#ifndef _INCLUDE_GUARD_OGLTEXTURE_H_
#define _INCLUDE_GUARD_OGLTEXTURE_H_



//==================================================================================================================================
// インクルード
//==================================================================================================================================

#ifndef _INCLUDE_GUARD_WINDOWS_H_
#define _INCLUDE_GUARD_WINDOWS_H_
#include <Windows.h>
#endif	// #ifndef _INCLUDE_GUARD_WINDOWS_H_



//==================================================================================================================================
// 前方宣言
//==================================================================================================================================
struct FILE_NAME_STRUCTURE;	// ファイル名構造体



//==================================================================================================================================
// 名前空間
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : リソース名前空間
//
// @note : 
//
// リソース関連の関数やクラス等を管理する名前空間。
//----------------------------------------------------------------------------------------------------------------------------------
namespace NS_Resource
{


	
//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : テクスチャ名前空間
//
// @note : 
//
// リソース関連の内、テクスチャ関連の関数やクラス等を管理する名前空間。
//----------------------------------------------------------------------------------------------------------------------------------
namespace NS_Texture
{



//==================================================================================================================================
// クラス定義
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : テクスチャクラス
//
// @note : 
//
// 各フォーマットのテクスチャクラスのベースとなるクラス。
// 画像ファイルから読み込んだデータを管理する。
//----------------------------------------------------------------------------------------------------------------------------------
class OGLTexture 
{
protected:

	// コンストラクタ
	OGLTexture();

public:

	// デストラクタ
	virtual ~OGLTexture();



	// テクスチャの読み込み
	HRESULT virtual Load( const char* pcFileName ) = 0;



	// ファイル名の取得
	const char* GetFileName() const;

	// テクスチャの取得
	unsigned int GetTexture() const;

	// テクスチャの幅の取得
	int GetWidth() const;

	// テクスチャの高さの取得
	int GetHeight() const;

protected:

	// テクスチャの生成
	void GenerateTexture( unsigned char* pucPixelData );

	// 24bitカラーのピクセルデータに変換
	void ConvertPixelsTo24BitColor( unsigned char* pucPixelData );

protected:

	// メンバ変数

	// 読み込みフラグ( true : 読み込んだ | false : 読み込んでない )
	bool					m_bLoadFlg;

	// ファイル名
	FILE_NAME_STRUCTURE*	m_pFileName;

	// テクスチャのフォーマット
	unsigned int			m_uiTextureFormat;

	// テクスチャ
	unsigned int			m_uiTexture;

	// テクスチャの幅
	long					m_lWidth;

	// テクスチャの高さ
	long					m_lHeight;
};



}	// namespace NS_Texture



}	// namespace NS_Resource



#endif	// #ifndef _INCLUDE_GUARD_OGLTEXTURE_H_