#ifndef _INCLUDE_GUARD_BULLET_H_
#define _INCLUDE_GUARD_BULLET_H_



//==================================================================================================================================
// インクルード
//==================================================================================================================================

#ifndef _INCLUDE_GUARD_GAMEOBJECT_H_
#include "../../../Base/GameObject.h"
#endif	// #ifndef _INCLUDE_GUARD_GAMEOBJECT_H_



//==================================================================================================================================
// 前方宣言
//==================================================================================================================================

// モデルクラス
namespace NS_Resource 
{
	namespace NS_Model 
	{ 
		class OGLModel;
	}
}



//==================================================================================================================================
// 名前空間
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : ゲーム名前空間
//
// @note : 
//
// ゲームアプリケーション関連の関数やクラスを管理する名前空間。
// ゲームを構成するクラスは全てこの名前空間に置くようにする。
//----------------------------------------------------------------------------------------------------------------------------------
namespace NS_OpenGLWindowPCGame
{



//==================================================================================================================================
// クラス定義
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : 弾クラス
//
// @note : 
//
// 機体が発射する弾を表現するクラス。
//----------------------------------------------------------------------------------------------------------------------------------
class Bullet : public GameObject
{
public:

	// コンストラクタ
	Bullet(
		const NS_Resource::NS_Model::OGLModel* pModel,
		const char* strSEShotName,
		const char* strSEHitName
	);

	// デストラクタ
	~Bullet();



	// 更新処理
	void Update();

	// 描画処理
	void Draw();



	// 初期化処理
	void Initialize(
		const float			fMoveSpeed, 
		const Vector3DF&	vec3Position,
		const Vector3DF&	vec3Rotation, 
		const Vector3DF&	vec3Scale,
		const Vector3DF&	vec3MoveDirection
	);

private:
	
	// 衝突中処理
	void OnColliding( const GameObject& gameObject );



	// 移動処理
	void Move();

	// 破棄処理
	void Destroy();

private:

	// メンバ変数

	// 移動の速さ
	float										m_fMoveSpeed;

	// タイマ
	float										m_fTimer;

	// 移動方向ベクトル
	Vector3DF									m_vec3MoveDirection;

	// モデル
	const NS_Resource::NS_Model::OGLModel*		m_pModel;

	// 発射のSE名
	const char*									m_strSEShotName;

	// 弾の衝突のSE名
	const char*									m_strSEHitName;
};



}	// namespace NS_OpenGLWindowPCGame



#endif	// #ifndef _INCLUDE_GUARD_BULLET_H_