#ifndef _INCLUDE_GUARD_CHASECAMERA_H_
#define _INCLUDE_GUARD_CHASECAMERA_H_



//==================================================================================================================================
// インクルード
//==================================================================================================================================

#ifndef _INCLUDE_GUARD_CAMERA_H_
#include "../../Base/Camera.h"
#endif	// #ifndef _INCLUDE_GUARD_CAMERA_H_



//==================================================================================================================================
// 名前空間
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : ゲーム名前空間
//
// @note : 
//
// ゲームアプリケーション関連の関数やクラスを管理する名前空間。
// ゲームを構成するクラスは全てこの名前空間に置くようにする。
//----------------------------------------------------------------------------------------------------------------------------------
namespace NS_OpenGLWindowPCGame
{



//==================================================================================================================================
// 構造体定義
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : 追跡カメラ記述子
//
// @note : 
//
// 追跡カメラの情報を管理する構造体。
//----------------------------------------------------------------------------------------------------------------------------------
struct CHASE_CAMERA_DESC
{
	// ターゲットとカメラの距離
	float		distance		= 0;

	// ターゲットを中心としたカメラの垂直方向回転角( X軸回転角 )
	float		verticalAngle	= 0;

	// ターゲットを中心としたカメラの水平方向回転角( Y軸回転角 )
	float		horizontalAngle	= 0;
	
	// ターゲットの位置
	Vector3DF*	target			= nullptr;
	
	// ターゲットからのオフセット位置( ターゲットからオフセットの値だけ離れた位置を注視する )
	Vector3DF	offset			= Vector3DF();
};



//==================================================================================================================================
// クラス定義
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : 追跡カメラクラス
//
// @extends / Camera : カメラクラス
//
// @note : 
//
// ターゲットを追跡する派生カメラクラス。
//----------------------------------------------------------------------------------------------------------------------------------
class ChaseCamera : public Camera
{
public:
	
	// コンストラクタ
	ChaseCamera();

	// コンストラクタ
	ChaseCamera( const CAMERA_DESC& cameraDesc, const CHASE_CAMERA_DESC& chaseCameraDesc );

	// デストラクタ
	~ChaseCamera();


	
	// 更新処理
	void Update();



	// 追跡カメラ記述子の取得
	const CHASE_CAMERA_DESC& GetChaseCameraDesc() const;

	// ターゲットとの距離の設定
	void SetDistance( const float fDistance );

	// 垂直方向回転角の設定
	void SetVerticalAngle( const float fVerticalAngle );

	// 水平方向回転角の設定
	void SetHorizontalAngle( const float fHorizontalAngle );

	// ターゲットの設定
	void SetTarget( Vector3DF* pvec3Target );

	// ターゲットからのオフセット位置の設定
	void SetOffset( const Vector3DF& vec3Offset );

private:

	// カメラのセッティング
	void SettingCamera();

private:

	// メンバ変数

	// 追跡カメラ記述子
	CHASE_CAMERA_DESC m_ChaseCameraDesc;
};



}	// namespace NS_OpenGLWindowPCGame



#endif	// #ifndef _INCLUDE_GUARD_CHASECAMERA_H_