#ifndef _INCLUDE_GUARD_SCENEMANAGER_H_
#define _INCLUDE_GUARD_SCENEMANAGER_H_



//==================================================================================================================================
// インクルード
//==================================================================================================================================
#ifndef _INCLUDE_GUARD_MYUTILITYLIB_H_
#include <MyUtilityLib.h>
#endif	// #ifndef _INCLUDE_GUARD_MYUTILITYLIB_H_



//==================================================================================================================================
// 前方宣言
//==================================================================================================================================

// 基底シーンクラス
namespace NS_OpenGLWindowPCGame { class BaseScene; }



//==================================================================================================================================
// 名前空間
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : ゲーム名前空間
//
// @note : 
//
// ゲームアプリケーション関連の関数やクラスを管理する名前空間。
// ゲームを構成するクラスは全てこの名前空間に置くようにする。
//----------------------------------------------------------------------------------------------------------------------------------
namespace NS_OpenGLWindowPCGame
{



//==================================================================================================================================
// クラス定義
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : シーン管理クラス
//
// @extends / Singleton	: シングルトンクラス
//
// @note : 
//
// シングルトンクラス。
// シーンを管理し、シーンの処理の実行やシーンの切り替え等を行う。
// 通常、プログラム上で起動しているシーンは1つだけになるようにする。
//----------------------------------------------------------------------------------------------------------------------------------
class SceneManager : public Singleton<SceneManager>
{
private:

	// フレンドクラス指定
	friend Singleton<SceneManager>;		// シングルトンクラス

public:

	// 実行処理
	void Run();

	// 描画処理
	void Draw();

	// 次に遷移するシーンの切り替え
	void ChangeNextScene( BaseScene* pScene );

private:

	// コンストラクタ
	SceneManager();

	// デストラクタ
	~SceneManager();

private:

	// メンバ変数

	// 現在のシーン
	BaseScene*			m_pCurrentScene;

	// 次に遷移するシーン
	BaseScene*			m_pNextScene;
};



}	// namespace NS_OpenGLWindowPCGame



#endif	// #ifndef _INCLUDE_GUARD_SCENEMANAGER_H_