#ifndef _INCLUDE_GUARD_MODELRESOURCELIBRARY_H_
#define _INCLUDE_GUARD_MODELRESOURCELIBRARY_H_



//==================================================================================================================================
// インクルード
//==================================================================================================================================

#ifndef _INCLUDE_GUARD_OGLMODEL_H_
#include "../../Resource/Model/Base/OGLModel.h"
#endif	// #ifndef _INCLUDE_GUARD_OGLMODEL_H_



//==================================================================================================================================
// 名前空間
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : リソース名前空間
//
// @note : 
//
// リソース関連の関数やクラス等を管理する名前空間。
//----------------------------------------------------------------------------------------------------------------------------------
namespace NS_Resource
{


	
//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : モデル名前空間
//
// @note : 
//
// リソース関連の内、モデル関連の関数やクラス等を管理する名前空間。
//----------------------------------------------------------------------------------------------------------------------------------
namespace NS_Model
{



	// モデルの読み込み
	const unsigned int LoadModel( const char* strPath );

	// モデルの取得
	const OGLModel* GetModel( const unsigned int uiResourceID );

	// モデルのクリア
	void ClearModel();

	// モデルのクリア
	void ClearModel( const unsigned int uiResourceID );



}	// namespace NS_Model



}	// namespace NS_Resource 



#endif	// #ifndef _INCLUDE_GUARD_MODELRESOURCELIBRARY_H_