#ifndef _INCLUDE_GUARD_OALDEVICE_H_
#define _INCLUDE_GUARD_OALDEVICE_H_



//==================================================================================================================================
// インクルード
//==================================================================================================================================
#ifndef _INCLUDE_GUARD_MYUTILITYLIB_H_
#include <MyUtilityLib.h>
#endif	// #ifndef _INCLUDE_GUARD_MYUTILITYLIB_H_

#ifndef _INCLUDE_GUARD_WINDOWS_H_
#include <Windows.h>
#endif	// #ifndef _INCLUDE_GUARD_WINDOWS_H_

#ifndef _INCLUDE_GUARD_ALC_H_
#include "../AL/alc.h"
#endif	// #ifndef _INCLUDE_GUARD_ALC_H_

#ifndef _INCLUDE_GUARD_AL_H_
#include "../AL/al.h"
#endif	// #ifndef _INCLUDE_GUARD_AL_H_



//==================================================================================================================================
// 名前空間
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : サウンド名前空間
//
// @note : 
//
// サウンド関連の関数やクラス等を管理する名前空間。
//----------------------------------------------------------------------------------------------------------------------------------
namespace NS_Sound 
{



//==================================================================================================================================
// クラス定義
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : OpenALデバイス管理クラス
//
// @extends / Singleton	: シングルトンクラス
//
// @note : 
//
// シングルトンクラス。
// OpenALのデバイスやコンテキストを管理する。
//----------------------------------------------------------------------------------------------------------------------------------
class OALDevice : public Singleton<OALDevice>
{
private:

	// フレンドクラス指定

	// シングルトンクラス
	friend Singleton<OALDevice>;

public:

	// OpenALデバイスの初期化
	HRESULT Initialize();

	// 解放処理
	void Release();

	// コンテキストの有効設定
	void Activate();

	// コンテキストの無効設定
	void Deactivate();

private:

	// コンストラクタ
	OALDevice();

	// デストラクタ
	~OALDevice();



	// OpenALのエラー検知
	bool IsError();

private:

	// メンバ変数

	// デバイス生成フラグ( true : 生成した | false : 生成してない )
	bool				m_bIsCreatedFlg;

	// OpenALデバイス
	ALCdevice*			m_pDevice;

	// OpenALコンテキスト
	ALCcontext*			m_pContext;
};



}	// namespace NS_Sound 



#endif	// #ifndef _INCLUDE_GUARD_OALDEVICE_H_