#ifndef _INCLUDE_GUARD_OALSOUNDSOURCE_H_
#define _INCLUDE_GUARD_OALSOUNDSOURCE_H_



//==================================================================================================================================
// 前方宣言
//==================================================================================================================================

// サウンドクリップ基底クラス
namespace NS_Sound { class SoundClip; }

// サウンド状態列挙
namespace NS_Sound { enum SOUND_STATE; }



//==================================================================================================================================
// 名前空間
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : サウンド名前空間
//
// @note : 
//
// サウンド関連の関数やクラス等を管理する名前空間。
//----------------------------------------------------------------------------------------------------------------------------------
namespace NS_Sound 
{



//==================================================================================================================================
// クラス定義
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : サウンドソースクラス
//
// @note : 
//
// サウンドクリップクラスを管理するクラス。
// サウンドの再生や停止等の操作を行う。
//----------------------------------------------------------------------------------------------------------------------------------
class OALSoundSource 
{
public:

	// コンストラクタ
	OALSoundSource( SoundClip* soundClip );

	// デストラクタ
	~OALSoundSource();
	


	// サウンドの再生
	void Play( const bool bIsLoop = false );

	// サウンドの一時停止
	void Pause();

	// サウンドの停止
	void Stop();

	// 音量の変更
	void ChangeVolume( float fVolume ) const;

	// ピッチの変更
	void ChangePitch( float fPitch ) const;



	// 音量の取得
	float GetVolume() const;

	// 音量の設定
	void SetVolume( const float fVolume );

	// ピッチの取得
	float GetPitch() const;

	// ピッチの設定
	void SetPitch( const float fPitch );

private:

	// バッファの生成
	void GenerateBuffer( const SoundClip* soundClip );

	// ソースの生成
	void GenerateSource();

	// 現在の再生状態の取得
	SOUND_STATE GetCurrentState() const;

protected:

	// メンバ変数

	// バッファ生成フラグ( true : 生成した | false : 生成してない )
	bool				m_bIsCreatedBufferFlg;

	// ソース生成フラグ( true : 生成した | false : 生成してない )
	bool				m_bIsCreatedSourceFlg;

	// バッファ
	unsigned int		m_uiBuffer;

	// ソース
	unsigned int		m_uiSource;

	// 音量
	float				m_fVolume;

	// ピッチ
	float				m_fPitch;
};



}	// namespace NS_Sound 



#endif	// #ifndef _INCLUDE_GUARD_OALSOUNDSOURCE_H_