#ifndef _INCLUDE_GUARD_SOUNDCLIP_H_
#define _INCLUDE_GUARD_SOUNDCLIP_H_



//==================================================================================================================================
// インクルード
//==================================================================================================================================
#ifndef _INCLUDE_GUARD_WINDOWS_H_
#include <Windows.h>
#endif	// #ifndef _INCLUDE_GUARD_WINDOWS_H_



//==================================================================================================================================
// 前方宣言
//==================================================================================================================================

// ファイル名構造体
struct FILE_NAME_STRUCTURE;



//==================================================================================================================================
// 名前空間
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : サウンド名前空間
//
// @note : 
//
// サウンド関連の関数やクラス等を管理する名前空間。
//----------------------------------------------------------------------------------------------------------------------------------
namespace NS_Sound 
{



//==================================================================================================================================
// 列挙定義
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : サウンドフォーマット列挙
//
// @note : 
//
//----------------------------------------------------------------------------------------------------------------------------------
enum SOUND_FORMAT
{
	MONAURAL_8,				//  8bitモノラル
	MONAURAL_16,			// 16bitモノラル
	STEREO_8,				//  8bitステレオ
	STEREO_16,				// 16bitステレオ

	UNKNOWN_SOUND_FORMAT,
};



//==================================================================================================================================
// クラス定義
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : サウンドクリップ基底クラス
//
// @note : 
//
// 各フォーマットのサウンドクリップクラスの基底となるクラス。
// サウンドファイルから読み込んだデータを管理する。
//----------------------------------------------------------------------------------------------------------------------------------
class SoundClip 
{
protected:

	// コンストラクタ
	SoundClip();

public:

	// デストラクタ
	virtual ~SoundClip();
	


	// ファイル読み込み
	HRESULT virtual Load( const char* pcFileName ) = 0;

	// データのクリア
	void Clear();



	// ファイル名の取得
	const FILE_NAME_STRUCTURE* GetFileName() const;

	// サウンドフォーマットの取得
	const SOUND_FORMAT GetFormat() const;
	
	// サンプリングレートの取得
	const unsigned int GetSamplingRate() const;
	
	// 波形データのサイズの取得
	const unsigned int GetWaveDataSize() const;

	// 波形データの取得
	const unsigned char* GetWaveData() const;

protected:

	// メンバ変数

	// サウンドファイル名
	FILE_NAME_STRUCTURE*	m_pFileName;

	// 読み込みフラグ( true : 読み込んだ | false : 読み込んでいない )
	bool					m_bIsLoaded;

	// サウンドフォーマット
	SOUND_FORMAT			m_Format;

	// サンプリングレート
	unsigned int			m_uiSamplingRate;

	// 波形データのサイズ
	unsigned int			m_puiWaveDataSize;

	// 波形データ
	unsigned char*			m_pucWaveData;
};



}	// namespace NS_Sound



#endif	// #ifndef _INCLUDE_GUARD_SOUNDCLIP_H_