#ifndef _INCLUDE_GUARD_BASEAPPLICATION_H_
#define _INCLUDE_GUARD_BASEAPPLICATION_H_



//==================================================================================================================================
// インクルード
//==================================================================================================================================
#ifndef _INCLUDE_GUARD_WINDOWS_H_
#define _INCLUDE_GUARD_WINDOWS_H_
#include <windows.h>
#endif	// #ifndef _INCLUDE_GUARD_WINDOWS_H_



//==================================================================================================================================
// 名前空間
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : ゲーム名前空間
//
// @note : 
//
// ゲームアプリケーション関連の関数やクラスを管理する名前空間。
// ゲームを構成するクラスは全てこの名前空間に置くようにする。
//----------------------------------------------------------------------------------------------------------------------------------
namespace NS_OpenGLWindowPCGame
{



//==================================================================================================================================
// クラス定義
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : 基底アプリケーションクラス
//
// @note : 
//
// 抽象クラス。
// ゲーム等のアプリケーションクラスの基盤となるクラス。
// アプリケーションの処理を純粋仮想関数として用意し、
// その実装を継承先のアプリケーションクラスに委託する。
//----------------------------------------------------------------------------------------------------------------------------------
class BaseApplication
{
public:

	// コンストラクタ
	BaseApplication();

	// デストラクタ
	virtual ~BaseApplication();



	// 初期化処理
	virtual void Initialize() = 0;
	
	// 更新処理
	virtual void Update() = 0;

	// 描画処理
	virtual void Display() = 0;
	
	// 終了処理
	virtual void Finish() = 0;



	// ウィンドウの幅の取得
	static unsigned int GetWindowWidth();

	// ウィンドウの高さの取得
	static unsigned int GetWindowHeight();

protected:

	// メンバ変数
};



};	// NS_OpenGLWindowPCGame



#endif	// #ifndef _INCLUDE_GUARD_BASEAPPLICATION_H_