#ifndef _INCLUDE_GUARD_SPHERECOLLIDER_H_
#define _INCLUDE_GUARD_SPHERECOLLIDER_H_



//==================================================================================================================================
// インクルード
//==================================================================================================================================

#ifndef _INCLUDE_GUARD_TRANSFORM_H_
#include "../Transform/Transform.h"
#endif	// #ifndef _INCLUDE_GUARD_TRANSFORM_H_

#ifndef _INCLUDE_GUARD_MYUTILITYLIB_H_
#include <MyUtilityLib.h>
#endif	// #ifndef _INCLUDE_GUARD_MYUTILITYLIB_H_



//==================================================================================================================================
// 名前空間
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : ゲーム名前空間
//
// @note : 
//
// ゲームアプリケーション関連の関数やクラスを管理する名前空間。
// ゲームを構成するクラスは全てこの名前空間に置くようにする。
//----------------------------------------------------------------------------------------------------------------------------------
namespace NS_OpenGLWindowPCGame
{



//==================================================================================================================================
// クラス定義
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : スフィアコライダクラス
//
// @note : 
//
// 球状のコライダを表現するクラス。
//----------------------------------------------------------------------------------------------------------------------------------
class SphereCollider
{
public:

	// コンストラクタ
	SphereCollider( const Transform& transform );

	// デストラクタ
	~SphereCollider();



	// 衝突判定
	bool CollisionDetection( const SphereCollider& sphereCollider );


	
	// 中心位置の取得
	const Vector3DF& GetCenter() const;

	// 半径の取得
	const float GetRadius() const;
	
	// 平行移動した中心位置の取得
	Vector3DF GetTranslatedCenter() const;
	
	// 中心位置の設定
	void SetCenter( const Vector3DF& vec3Center );
	
	// 半径の設定
	void SetRadius( const float fRadius );

private:
	
	// メンバ変数

	// 中心位置
	Vector3DF				m_vec3Center;

	// 球の半径
	float					m_fRadius;

	// トランスフォーム
	const Transform&		m_Transform;
};



}	// namespace NS_OpenGLWindowPCGame



#endif	// #ifndef _INCLUDE_GUARD_SPHERECOLLIDER_H_