#ifndef _INCLUDE_GUARD_STAGE_H_
#define _INCLUDE_GUARD_STAGE_H_



//==================================================================================================================================
// 名前空間
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : ゲーム名前空間
//
// @note : 
//
// ゲームアプリケーション関連の関数やクラスを管理する名前空間。
// ゲームを構成するクラスは全てこの名前空間に置くようにする。
//----------------------------------------------------------------------------------------------------------------------------------
namespace NS_OpenGLWindowPCGame
{



//==================================================================================================================================
// クラス定義
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : ステージクラス
//
// @note : 
//
// ステージを構成するクラス。
//----------------------------------------------------------------------------------------------------------------------------------
class Stage 
{
public:

	// コンストラクタ
	Stage();

	// デストラクタ
	~Stage();



	// 初期化処理
	void Initialize();

	// 更新処理
	void Update();

	// 描画処理
	void Draw();

private:

	void DrawStageVerticalLines( const float fLineWidth, const unsigned int uiLineCount ) const;

	void DrawStageHorizontalLines( const float fLineWidth, const unsigned int uiLineCount ) const;

private:

	// メンバ変数
};



}	// namespace NS_OpenGLWindowPCGame



#endif	// #ifndef _INCLUDE_GUARD_STAGE_H_