//==================================================================================================================================
// インクルード
//==================================================================================================================================

#ifndef _INCLUDE_GUARD_TITLESCENE_H_
#include "TitleScene.h"
#endif	// #ifndef _INCLUDE_GUARD_TITLESCENE_H_

#ifndef _INCLUDE_GUARD_MAINSCENE_H_
#include "../02_Main/MainScene.h"
#endif	// #ifndef _INCLUDE_GUARD_MAINSCENE_H_

#ifndef _INCLUDE_GUARD_BASEAPPLICATION_H_
#include "../../../Application/Base/BaseApplication.h"
#endif	// #ifndef _INCLUDE_GUARD_BASEAPPLICATION_H_

#ifndef _INCLUDE_GUARD_FPS_H_
#include "../../../Time/FPS/Fps.h"
#endif	// #ifndef _INCLUDE_GUARD_FPS_H_

#ifndef _INCLUDE_GUARD_SPRITE_H_
#include "../../../Sprite/Sprite.h"
#endif	// #ifndef _INCLUDE_GUARD_SPRITE_H_

#ifndef _INCLUDE_GUARD_WINDOWSAPIINPUTLIB_H_
#include <WindowsAPIInputLib.h>
#endif	// #ifndef _INCLUDE_GUARD_WINDOWSAPIINPUTLIB_H_

#ifndef _INCLUDE_GUARD_OPENGLGRAPHICLIB_H_
#include <OpenGLGraphicLib.h>
#endif	// #ifndef _INCLUDE_GUARD_OPENGLGRAPHICLIB_H_

#ifndef _INCLUDE_GUARD_OPENGLRESOURCELIB_H_
#include <OpenGLResourceLib.h>
#endif	// #ifndef _INCLUDE_GUARD_OPENGLRESOURCELIB_H_

#ifndef _INCLUDE_GUARD_MYUTILITYLIB_H_
#include <MyUtilityLib.h>
#endif	// #ifndef _INCLUDE_GUARD_MYUTILITYLIB_H_



//==================================================================================================================================
// usingディレクティブ
//==================================================================================================================================

// ゲーム名前空間
using namespace NS_OpenGLWindowPCGame;



//==================================================================================================================================
// 関数定義
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : コンストラクタ
//
// @note : 
//
//----------------------------------------------------------------------------------------------------------------------------------
TitleScene::TitleScene() :
	m_titleLogoTexture( 0 ),
	m_titleLogoSprite( nullptr )
{ 

}



//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : デストラクタ
//
// @note : 
//
//----------------------------------------------------------------------------------------------------------------------------------
TitleScene::~TitleScene() 
{
	SAFE_DELETE( this->m_titleLogoSprite );
}



//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : 初期化処理
//
// @note : 
//
// 初期化に関する処理はここで行う。
// シーン開始後のシーン切り替え時に1回行なわれる。
//----------------------------------------------------------------------------------------------------------------------------------
void TitleScene::Initialize() 
{ 
	SPRITE_DESC desc;

	desc.textureResourceID = this->m_titleLogoTexture;

	desc.scale = Vector3DF( 1, 0.4f, 1 );

	this->m_titleLogoSprite = new Sprite( desc );
}



//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : 更新処理
//
// @note : 
//
// 更新に関する処理はここで行う。
// シーンが継続している間、描画処理の前に繰り返し行なわれる。
//----------------------------------------------------------------------------------------------------------------------------------
void TitleScene::Update() 
{ 
	if ( NS_Input::NS_Keyboard::GetKeyDown( VK_SPACE ) ) { m_bSceneEndFlg = true; }
}



//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : 描画処理
//
// @note : 
//
// 描画に関する処理はここで行う。
// シーンが継続している間、更新処理の後に繰り返し行なわれる。
//----------------------------------------------------------------------------------------------------------------------------------
void TitleScene::Draw() 
{
	this->m_titleLogoSprite->Draw();
}



//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : 終了処理
//
// @note : 
//
// 終了に関する処理はここで行う。
// シーン終了後のシーン切り替え時に1回行なわれる。
//----------------------------------------------------------------------------------------------------------------------------------
void TitleScene::Finish() 
{ 

}



//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : 次に遷移するシーンの生成
//
// @note : 
//
// 次に遷移するシーンを生成する。
// シーン切り替え時等の必要なタイミングで呼び出すように注意する。
//----------------------------------------------------------------------------------------------------------------------------------
void TitleScene::CreateNextScene() 
{
	if ( !POINTER_CHECK( m_pNextScene ) ) 
	{
		m_pNextScene = new MainScene;
	}
}



//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : コンテンツロード
//
// @note : 
//
// コンテンツの読み込み処理はここで行う。
// シーン開始後のシーン切り替え時に1回行なわれる。
//----------------------------------------------------------------------------------------------------------------------------------
void TitleScene::LoadContent() 
{ 
	this->m_titleLogoTexture = NS_Resource::NS_Texture::LoadTexture( "Resource/Graphic/Texture/text_push_space_key.tga" );
}



//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : コンテンツアンロード
//
// @note : 
//
// コンテンツの解放処理はここで行う。
// シーン終了後のシーン切り替え時に1回行なわれる。
//----------------------------------------------------------------------------------------------------------------------------------
void TitleScene::UnloadContent() 
{
	NS_Resource::ClearResource();
}