#ifndef _INCLUDE_GUARD_TITLESCENE_H_
#define _INCLUDE_GUARD_TITLESCENE_H_



//==================================================================================================================================
// インクルード
//==================================================================================================================================

#ifndef _INCLUDE_GUARD_BASESCENE_H_
#include "../Base/BaseScene.h"
#endif	// #ifndef _INCLUDE_GUARD_BASESCENE_H_



class Sprite;



//==================================================================================================================================
// 名前空間
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : ゲーム名前空間
//
// @note : 
//
// ゲームアプリケーション関連の関数やクラスを管理する名前空間。
// ゲームを構成するクラスは全てこの名前空間に置くようにする。
//----------------------------------------------------------------------------------------------------------------------------------
namespace NS_OpenGLWindowPCGame
{



//==================================================================================================================================
// クラス定義
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : タイトルシーンクラス
//
// @extends / BaseScene	: 基底シーンクラス
//
// @note : 
//
// タイトルシーンを管理するクラス。
//----------------------------------------------------------------------------------------------------------------------------------
class TitleScene : public BaseScene
{
public:

	// コンストラクタ
	TitleScene();

	// デストラクタ
	~TitleScene();



	// 初期化処理
	void Initialize();

	// 更新処理
	void Update();

	// 描画処理
	void Draw();

	// 終了処理
	void Finish();

	// コンテンツロード
	void LoadContent();

	// コンテンツアンロード
	void UnloadContent();

private:

	// 次に遷移するシーンの生成
	void CreateNextScene();

private:
	
	// メンバ変数

	unsigned int m_titleLogoTexture;

	Sprite* m_titleLogoSprite;
};



}	// namespace NS_OpenGLWindowPCGame



#endif	// #ifndef _INCLUDE_GUARD_TITLESCENE_H_