#ifndef _INCLUDE_GUARD_BASESCENE_H_
#define _INCLUDE_GUARD_BASESCENE_H_



//==================================================================================================================================
// インクルード
//==================================================================================================================================

#ifndef _INCLUDE_GUARD_GAMEOBJECTMANAGER_H_
#include "../../../GameObject/Manager/GameObjectManager.h"
#endif	// #ifndef _INCLUDE_GUARD_GAMEOBJECTMANAGER_H_

#ifndef _INCLUDE_GUARD_CAMERA_H_
#include "../../../Camera/Base/Camera.h"
#endif	// #ifndef _INCLUDE_GUARD_CAMERA_H_



//==================================================================================================================================
// 名前空間
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : ゲーム名前空間
//
// @note : 
//
// ゲームアプリケーション関連の関数やクラスを管理する名前空間。
// ゲームを構成するクラスは全てこの名前空間に置くようにする。
//----------------------------------------------------------------------------------------------------------------------------------
namespace NS_OpenGLWindowPCGame
{



//==================================================================================================================================
// クラス定義
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : 基底シーンクラス
//
// @note : 
//
// 抽象クラス。
// 各シーンクラスの基底クラスとなる。
// シーンクラス作成にはこのクラスを継承する。
//----------------------------------------------------------------------------------------------------------------------------------
class BaseScene 
{
public:

	// デストラクタ
	virtual ~BaseScene();



	// 初期化処理
	virtual void Initialize() = 0;

	// 更新処理
	virtual void Update() = 0;

	// 描画処理
	virtual void Draw() = 0;

	// 終了処理
	virtual void Finish() = 0;

	// コンテンツロード
	virtual void LoadContent() = 0;

	// コンテンツアンロード
	virtual void UnloadContent() = 0;



	// シーン終了か?
	bool isEndScene() const;

	// 次に遷移するシーンの取得
	BaseScene* GetNextScene();

protected:

	// コンストラクタ
	BaseScene();

	

	// 次に遷移するシーンの生成
	virtual void CreateNextScene() = 0;

protected:

	// メンバ変数
	
	// シーン終了フラグ( true : シーン終了 | false : シーン継続 )
	bool					m_bSceneEndFlg;

	// 次に遷移するシーン
	BaseScene*				m_pNextScene;

	// ゲームオブジェクト管理クラス
	GameObjectManager*		m_pGameObjectManager;

	// カメラ
	Camera*					m_pCamera;
};



}	// namespace NS_OpenGLWindowPCGame



#endif	// _INCLUDE_GUARD_BASESCENE_H_