//==================================================================================================================================
// インクルード
//==================================================================================================================================

#ifndef _INCLUDE_GUARD_MODELDIRECTOR_H_
#include "ModelDirector.h"
#endif	// #ifndef _INCLUDE_GUARD_MODELDIRECTOR_H_

#ifndef _INCLUDE_GUARD_OGLOBJMODEL_H_
#include "../../../Resource/Model/Format/WavefrontOBJ/OGLObjModel.h"
#endif	// #ifndef _INCLUDE_GUARD_OGLOBJMODEL_H_



//==================================================================================================================================
// usingディレクティブ
//==================================================================================================================================

// リソース名前空間
using namespace NS_Resource;

// モデル名前空間
using namespace NS_Model;



//==================================================================================================================================
// 関数定義
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : コンストラクタ
//
// @note : 
//
//----------------------------------------------------------------------------------------------------------------------------------
ModelDirector::ModelDirector() : ResourceDirector( eRESOURCE_TYPE::MODEL )
{ 

}



//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : デストラクタ
//
// @note : 
//
//----------------------------------------------------------------------------------------------------------------------------------
ModelDirector::~ModelDirector() 
{
	// リソースのクリア
	Clear();
}



//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : リソースの読み込み
//
// @param [in] / const char* strPath : リソースファイルのパス
//
// @return / const unsigned int : リソースID
//	
// @note : 
//
// モデルリソースファイルを読み込み、モデルリソースを生成する。
// 生成したリソースに対応するリソースIDを返す。
//----------------------------------------------------------------------------------------------------------------------------------
const unsigned int ModelDirector::Load( const char* strPath )
{
	// 同じリソースが既に読み込まれていないかチェックする

	unsigned int uiResourceID = GetResourceID( strPath, false );

	if ( uiResourceID != ERROR_RESOURCE_ID ) 
	{
		DEBUG_CONSOLE_LOG( "リソース\"%s\"は既に読み込まれています。", strPath );

		return uiResourceID;
	}



	// ファイル名構造体
	FILE_NAME_STRUCTURE filename( strPath );

	// モデル
	OGLModel*			pModel = nullptr;



	// フォーマット別にモデルを生成

	// WavefrontOBJファイル
	if ( strcmp( filename.GetExtensions().c_str(), ".obj" ) == 0 ) 
	{
		// WavefrontOBJフォーマットモデルを生成
		pModel = new OGLObjModel;
	}

	// 対応していないフォーマットは読み込まない
	else 
	{
		DEBUG_CONSOLE_LOG( "\"%s\"は対応していないフォーマットです。", filename.GetExtensions().c_str() ); 
		
		return ERROR_RESOURCE_ID; 
	}



	// モデルを読み込む
	if ( FAILED( pModel->Load( strPath ) ) ) 
	{
		SAFE_DELETE( pModel );

		DEBUG_CONSOLE_LOG( "リソース\"%s\"の読み込みに失敗しました。", strPath ); 
		
		return ERROR_RESOURCE_ID; 
	};



	// リソースマップにモデルを追加
	return PushResource( strPath, pModel );
}