#ifndef _INCLUDE_GUARD_STARSPRITEMANAGER_H_
#define _INCLUDE_GUARD_STARSPRITEMANAGER_H_



//==================================================================================================================================
// インクルード
//==================================================================================================================================

#ifndef _INCLUDE_GUARD_SPRITE_H_
#include "../../../Sprite/Sprite.h"
#endif	// #ifndef _INCLUDE_GUARD_SPRITE_H_

#ifndef _INCLUDE_GUARD_LIST_
#define _INCLUDE_GUARD_LIST_
#include <list>
#endif	// #ifndef _INCLUDE_GUARD_LIST_




//==================================================================================================================================
// 名前空間
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : ゲーム名前空間
//
// @note : 
//
// ゲームアプリケーション関連の関数やクラスを管理する名前空間。
// ゲームを構成するクラスは全てこの名前空間に置くようにする。
//----------------------------------------------------------------------------------------------------------------------------------
namespace NS_OpenGLWindowPCGame
{



//==================================================================================================================================
// クラス定義
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : 星スプライト管理クラス
//
// @note : 
//
// 星スプライトを管理するクラス。
//----------------------------------------------------------------------------------------------------------------------------------
class StarSpriteManager
{
public:

	// コンストラクタ
	StarSpriteManager( const SPRITE_DESC& desc, const Vector3DF& vec3Space, const unsigned int uiCount );

	// デストラクタ
	~StarSpriteManager();

	

	// 描画処理
	void Draw();

private:

	// メンバ変数

	// 星スプライトリスト
	std::list<Sprite*> m_StarSpriteList;
};



}	// namespace NS_OpenGLWindowPCGame



#endif	// #ifndef _INCLUDE_GUARD_STARSPRITEMANAGER_H_