#ifndef _INCLUDE_GUARD_FPS_H_
#define _INCLUDE_GUARD_FPS_H_



//==================================================================================================================================
// インクルード
//==================================================================================================================================

#ifndef _INCLUDE_GUARD_MYUTILITYLIB_H_
#include <MyUtilityLib.h>
#endif	// #ifndef _INCLUDE_GUARD_MYUTILITYLIB_H_



//==================================================================================================================================
// 名前空間
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : ゲーム名前空間
//
// @note : 
//
// ゲームアプリケーション関連の関数やクラスを管理する名前空間。
// ゲームを構成するクラスは全てこの名前空間に置くようにする。
//----------------------------------------------------------------------------------------------------------------------------------
namespace NS_OpenGLWindowPCGame
{



//==================================================================================================================================
// クラス定義
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : FPSクラス
//
// @extends / Singleton	: シングルトンクラス
//
// @note : 
//
// シングルトンクラス。
// FPSの制御を行うクラス。
//----------------------------------------------------------------------------------------------------------------------------------
class Fps : public Singleton<Fps>
{
private:

	// フレンドクラス指定
	friend Singleton<Fps>;

public:

	// FPSの測定
	void MeasureFPS();

	// 待機処理
	void Wait();



	// FPSが安定しているか?
	bool IsStableFPS( const float fTolerance ) const;



	// 現在のFPSの取得
	float GetFPS() const;

	// 現在のSPFの取得
	float GetSPF() const;

	// 固定するFPSの取得
	unsigned int GetFixedFPS() const;
	
	// 固定するFPSの設定
	void SetFixedFPS( const unsigned int uiFPS );
	
	// 平均を取るサンプル数の取得
	unsigned int GetSamplingCount() const;
	
	// 平均を取るサンプル数の設定
	void SetSamplingCount( const unsigned int uiSamplingCount );

private:
	
	// コンストラクタ
	Fps();

	// デストラクタ
	~Fps();

private:

	// メンバ変数

	// 測定開始時間
	unsigned long		m_ulStartTime;

	// フレームカウンタ
	unsigned int		m_uiFrameCount;

	// 現在のFPS
	float				m_fCurrentFps;

	// 固定するFPS
	unsigned int		m_uiFixedFPS;

	// 平均を取るサンプル数
	unsigned int		m_uiSamplingCount;
};



}	// namespace NS_OpenGLWindowPCGame



#endif	// #ifndef _INCLUDE_GUARD_FPS_H_