#ifndef _INCLUDE_GUARD_TARGET_H_
#define _INCLUDE_GUARD_TARGET_H_



//==================================================================================================================================
// インクルード
//==================================================================================================================================

#ifndef _INCLUDE_GUARD_GAMEOBJECT_H_
#include "../../Base/GameObject.h"
#endif	// #ifndef _INCLUDE_GUARD_GAMEOBJECT_H_



//==================================================================================================================================
// 名前空間
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : ゲーム名前空間
//
// @note : 
//
// ゲームアプリケーション関連の関数やクラスを管理する名前空間。
// ゲームを構成するクラスは全てこの名前空間に置くようにする。
//----------------------------------------------------------------------------------------------------------------------------------
namespace NS_OpenGLWindowPCGame
{



//==================================================================================================================================
// クラス定義
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : 的クラス
//
// @extends / GameObject : ゲームオブジェクトクラス
//
// @note : 
//
// プレイヤーが撃つ対象となる的を構成するクラス。
//----------------------------------------------------------------------------------------------------------------------------------
class Target : public GameObject
{
public:

	// コンストラクタ
	Target();

	// デストラクタ
	~Target();



	// 更新処理
	void Update();

	// 描画処理
	void Draw();



	// 初期化処理
	void Initialize(
		const float			fMoveSpeed, 
		const Vector3DF&	vec3Position,
		const Vector3DF&	vec3Rotation, 
		const Vector3DF&	vec3Scale
	);

private:
	
	// 衝突中処理
	void OnColliding( const GameObject& gameObject );



	// 移動処理
	void Move();

private:

	// メンバ変数

	// 移動の速さ
	float										m_fMoveSpeed;

	// 移動方向ベクトル
	Vector3DF									m_vec3MoveDirection;
};



}	// namespace NS_OpenGLWindowPCGame



#endif	// #ifndef _INCLUDE_GUARD_TARGET_H_