#ifndef _INCLUDE_GUARD_SPRITE_H_
#define _INCLUDE_GUARD_SPRITE_H_



//==================================================================================================================================
// インクルード
//==================================================================================================================================

#ifndef _INCLUDE_GUARD_MYUTILITYLIB_H_
#include <MyUtilityLib.h>
#endif	// #ifndef _INCLUDE_GUARD_MYUTILITYLIB_H_

#ifndef _INCLUDE_GUARD_OPENGLRESOURCELIB_H_
#include <OpenGLResourceLib.h>
#endif	// #ifndef _INCLUDE_GUARD_OPENGLRESOURCELIB_H_



//==================================================================================================================================
// 構造体定義
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : スプライト記述子
//
// @note : 
//
// スプライトのデータをまとめる構造体。
//----------------------------------------------------------------------------------------------------------------------------------
struct SPRITE_DESC
{
	// スケール値
	Vector3DF		scale				= Vector3DF( 1, 1, 1 );

	// 座標
	Vector3DF		position			= Vector3DF( 0, 0, 0 );

	// オイラー回転角
	Vector3DF		rotation			= Vector3DF( 0, 0, 0 );

	// カラー
	Color4F			color				= COLOR4F_WHITE;

	// テクスチャのタイリング
	Vector2DF		textureTiling		= Vector2DF( 1, 1 );

	// テクスチャの開始位置
	Vector2DF		textureOffset		= Vector2DF( 0, 0 );

	// ビルボードの設定
	bool			billboard			= false;

	// テクスチャのリソースID
	unsigned int	textureResourceID	= ERROR_RESOURCE_ID;
};



//==================================================================================================================================
// クラス定義
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : スプライトクラス
//
// @note : 
//
// スプライトを表現したクラス。
// テクスチャマッピングした四角ポリゴンを描画する。
//----------------------------------------------------------------------------------------------------------------------------------
class Sprite 
{
public:

	// コンストラクタ
	Sprite( const SPRITE_DESC& desc );

	// デストラクタ
	~Sprite();



	// 描画処理
	void Draw();

	// スプライト記述子の取得
	const SPRITE_DESC& GetDesc() const;

private:

	// メンバ変数

	// スプライト記述子
	SPRITE_DESC m_Desc;
};



#endif	// #ifndef _INCLUDE_GUARD_SPRITE_H_