//==================================================================================================================================
// インクルード
//==================================================================================================================================
#ifndef _INCLUDE_GUARD_WAPIINPUTKEYBOARD_H_
#include "WAPIInputKeyboard.h"
#endif	// #ifndef _INCLUDE_GUARD_WAPIINPUTKEYBOARD_H_

#ifndef _INCLUDE_GUARD_WAPIKEYBOARDMANAGER_H_
#include "Manager/WAPIKeyboardManager.h"
#endif	// #ifndef _INCLUDE_GUARD_WAPIKEYBOARDMANAGER_H_



//==================================================================================================================================
// 関数定義
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : キーボードの入力状態の更新
//
// @return / HRESULT : 入力状態の更新に成功したか( true : 成功 | false : 失敗 )
//	
// @note : 
//
// キーボードの入力状態のデータを更新する。
// この関数は毎フレーム1回実行する必要がある。
//----------------------------------------------------------------------------------------------------------------------------------
extern bool NS_Input::NS_Keyboard::UpdateKeyState() 
{
	return SUCCEEDED( WAPIKeyboardManager::Instance()->UpdateKeyState() );
}



//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : キーの押下判定
//
// @param [in] / const unsigned char ucKey	: 入力判定するキー
//
// @return / bool : 指定のキーが押されているか
//	
// @note : 
//
// キーが押されているか判定する。
//
// 引数のキーは、''で囲むか「VK_○○」という定数を使う。
// これはWinUser.hに定義されている。
//
// ex) Aキー		: 'A'
//	   スペースキー : VK_SPACE
//
// キーが離されているかを判定するには、
// この関数の戻り値を否定して使う。
//
// ex) 押下判定 : if (  GetKey( キー ) ) { ～
//     遊離判定 : if ( !GetKey( キー ) ) { ～
//----------------------------------------------------------------------------------------------------------------------------------
bool NS_Input::NS_Keyboard::GetKey( const unsigned char ucKey ) 
{ 
	return WAPIKeyboardManager::Instance()->GetKey( ucKey );
}



//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : キーの押下の瞬間の判定
//
// @param [in] / const unsigned char ucKey	: 入力判定するキー
//
// @return / bool : 指定のキーが押下の瞬間か
//	
// @note : 
//
// キーが押下の瞬間か判定する。
//
// 引数のキーは、''で囲むか「VK_○○」という定数を使う。
// キーの定数はWinUser.hに定義されている。
//----------------------------------------------------------------------------------------------------------------------------------
bool NS_Input::NS_Keyboard::GetKeyDown( const unsigned char ucKey ) 
{ 
	return WAPIKeyboardManager::Instance()->GetKeyDown( ucKey );
}



//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : キーの遊離の瞬間の判定
//
// @param [in] / const unsigned char ucKey	: 入力判定するキー
//
// @return / bool : 指定のキーが遊離の瞬間か
//	
// @note : 
//
// キーが遊離の瞬間か判定する。
//
// 引数のキーは、''で囲むか「VK_○○」という定数を使う。
// キーの定数はWinUser.hに定義されている。
//----------------------------------------------------------------------------------------------------------------------------------
bool NS_Input::NS_Keyboard::GetKeyUp( const unsigned char ucKey ) 
{ 
	return WAPIKeyboardManager::Instance()->GetKeyUp( ucKey );
}