#ifndef _INCLUDE_GUARD_WAPIINPUTKEYBOARD_H_
#define _INCLUDE_GUARD_WAPIINPUTKEYBOARD_H_



//==================================================================================================================================
// 名前空間
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : 入力名前空間
//
// @note : 
//
// 入力関連の関数やクラス等を管理する名前空間。
//----------------------------------------------------------------------------------------------------------------------------------
namespace NS_Input
{


	
//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : キーボード名前空間
//
// @note : 
//
// 入力関連の内、キーボード関連の関数やクラス等を管理する名前空間。
//----------------------------------------------------------------------------------------------------------------------------------
namespace NS_Keyboard
{

	
	
	// キーボードの入力状態の更新
	bool UpdateKeyState();

	// キーの押下判定
	bool GetKey( const unsigned char ucKey );

	// キーの押下の瞬間の判定
	bool GetKeyDown( const unsigned char ucKey );

	// キーの遊離の瞬間の判定
	bool GetKeyUp( const unsigned char ucKey );



}	// namespace NS_Keyboard



}	// namespace NS_Input



#endif	// #ifndef _INCLUDE_GUARD_WAPIINPUTKEYBOARD_H_