#ifndef _INCLUDE_GUARD_GAMEOBJECTMANAGER_H_
#define _INCLUDE_GUARD_GAMEOBJECTMANAGER_H_



//==================================================================================================================================
// インクルード
//==================================================================================================================================

#ifndef _INCLUDE_GUARD_GAMEOBJECT_H_
#include "../Base/GameObject.h"
#endif	// #ifndef _INCLUDE_GUARD_GAMEOBJECT_H_

#ifndef _INCLUDE_GUARD_LIST_
#define _INCLUDE_GUARD_LIST_
#include <list>
#endif	// #ifndef _INCLUDE_GUARD_LIST_



//==================================================================================================================================
// 名前空間
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : ゲーム名前空間
//
// @note : 
//
// ゲームアプリケーション関連の関数やクラスを管理する名前空間。
// ゲームを構成するクラスは全てこの名前空間に置くようにする。
//----------------------------------------------------------------------------------------------------------------------------------
namespace NS_OpenGLWindowPCGame
{



//==================================================================================================================================
// クラス定義
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : シーン管理クラス
//
// @note : 
//
// ゲームオブジェクトを管理するクラス。
//----------------------------------------------------------------------------------------------------------------------------------
class GameObjectManager
{
public:

	// コンストラクタ
	GameObjectManager();

	// デストラクタ
	~GameObjectManager();



	// 更新処理
	void Update();

	// 描画処理
	void Draw();



	// ゲームオブジェクトの追加
	void AddGameObject( GameObject* pGameObject );

private:

	// ゲームオブジェクトリスト型
	typedef std::list<GameObject*> GameObjectList;

	// メンバ変数

	// ゲームオブジェクトリスト
	GameObjectList m_GameObjectList;
};



}	// namespace NS_OpenGLWindowPCGame



#endif	// #ifndef _INCLUDE_GUARD_GAMEOBJECTMANAGER_H_