#ifndef _INCLUDE_GUARD_WAPIKEYBOARDMANAGER_H_
#define _INCLUDE_GUARD_WAPIKEYBOARDMANAGER_H_



//==================================================================================================================================
// マクロ定義
//==================================================================================================================================

// キーの数
#define KEY_COUNT 256



//==================================================================================================================================
// インクルード
//==================================================================================================================================
#ifndef _INCLUDE_GUARD_MYUTILITYLIB_H_
#include <MyUtilityLib.h>
#endif	// #ifndef _INCLUDE_GUARD_MYUTILITYLIB_H_



//==================================================================================================================================
// 名前空間
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : 入力名前空間
//
// @note : 
//
// 入力関連の関数やクラス等を管理する名前空間。
//----------------------------------------------------------------------------------------------------------------------------------
namespace NS_Input
{


	
//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : キーボード名前空間
//
// @note : 
//
// 入力関連の内、キーボード関連の関数やクラス等を管理する名前空間。
//----------------------------------------------------------------------------------------------------------------------------------
namespace NS_Keyboard
{



//==================================================================================================================================
// クラス定義
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : キーボードクラス
//
// @extends / Singleton	: シングルトンクラス
//
// @note : 
//
// シングルトンクラス。
// キーボードの入力情報を管理するクラス。
//----------------------------------------------------------------------------------------------------------------------------------
class WAPIKeyboardManager : public Singleton<WAPIKeyboardManager>
{
private:

	// フレンドクラス指定

	// シングルトンクラス
	friend Singleton<WAPIKeyboardManager>;

public:
	
	// キーボードの入力状態の更新
	HRESULT UpdateKeyState();



	// キーの押下判定
	bool GetKey( const unsigned char ucKey );

	// キーの押下の瞬間の判定
	bool GetKeyDown( const unsigned char ucKey );

	// キーの遊離の瞬間の判定
	bool GetKeyUp( const unsigned char ucKey );

private:
	
	// コンストラクタ
	WAPIKeyboardManager();

	// デストラクタ
	~WAPIKeyboardManager();

private:
	
	// メンバ変数

	// 現在のキーボード入力状態データ
	unsigned char m_ucCurrentKeyStateArray[ KEY_COUNT ];

	// 前回のキーボード入力状態データ
	unsigned char m_ucLastKeyStateArray[ KEY_COUNT ];
};



}	// namespace NS_Keyboard



}	// namespace NS_Input



#endif	// _INCLUDE_GUARD_WAPIKEYBOARDMANAGER_H_