#ifndef _INCLUDE_GUARD_MESH_H_
#define _INCLUDE_GUARD_MESH_H_



//==================================================================================================================================
// インクルード
//==================================================================================================================================

#ifndef _INCLUDE_GUARD_MYUTILITYLIB_H_
#include <MyUtilityLib.h>
#endif	// #ifndef _INCLUDE_GUARD_MYUTILITYLIB_H_



//==================================================================================================================================
// 名前空間
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : リソース名前空間
//
// @note : 
//
// リソース関連の関数やクラス等を管理する名前空間。
//----------------------------------------------------------------------------------------------------------------------------------
namespace NS_Resource
{


	
//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : モデル名前空間
//
// @note : 
//
// リソース関連の内、モデル関連の関数やクラス等を管理する名前空間。
//----------------------------------------------------------------------------------------------------------------------------------
namespace NS_Model
{



//==================================================================================================================================
// 構造体定義
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : メッシュ構造体
//
// @note : 
//
// メッシュを構成する要素をまとめた構造体。
//----------------------------------------------------------------------------------------------------------------------------------
struct MESH
{
	// コンストラクタ
	MESH() { }

	// デストラクタ
	~MESH() 
	{
		// 頂点座標インデックスデータをクリア
		for each ( auto vertexPositionIndex in vertexPositionIndexData ) 
		{
			SAFE_DELETE( vertexPositionIndex.second );
		}
		vertexPositionIndexData.clear();

		// 法線インデックスデータをクリア
		for each ( auto normalIndex in normalIndexData ) 
		{
			SAFE_DELETE( normalIndex.second );
		}
		normalIndexData.clear();

		// テクスチャ座標インデックスデータをクリア
		for each ( auto texcoordIndex in texcoordIndexData ) 
		{
			SAFE_DELETE( texcoordIndex.second );
		}
		texcoordIndexData.clear();
	}



	// 頂点座標データ
	std::vector<Vector3DF>						vertexPositionData;

	// 法線データ
	std::vector<Vector3DF>						normalData;

	// テクスチャ座標データ
	std::vector<Vector2DF>						texCoordData;

	// 頂点座標インデックス( ポリゴン )データ
	std::multimap<std::string, Vector3DI*>		vertexPositionIndexData;

	// 法線インデックスデータ
	std::multimap<std::string, Vector3DI*>		normalIndexData;

	// テクスチャ座標インデックスデータ
	std::multimap<std::string, Vector3DI*>		texcoordIndexData;
};



}	// namespace NS_Model



}	// namespace NS_Resource



#endif	// #ifndef _INCLUDE_GUARD_MESH_H_