//==================================================================================================================================
// インクルード
//==================================================================================================================================
#ifndef _INCLUDE_GUARD_GAMEOVER_H_
#include "GameOver.h"
#endif	// #ifndef _INCLUDE_GUARD_GAMEOVER_H_

#ifndef _INCLUDE_GUARD_TITLESCENE_H_
#include "../01_Title/TitleScene.h"
#endif	// #ifndef _INCLUDE_GUARD_TITLESCENE_H_

#ifndef _INCLUDE_GUARD_BASEAPPLICATION_H_
#include "../../../Application/Base/BaseApplication.h"
#endif	// #ifndef _INCLUDE_GUARD_BASEAPPLICATION_H_

#ifndef _INCLUDE_GUARD_WINDOWSAPIINPUTLIB_H_
#include <WindowsAPIInputLib.h>
#endif	// #ifndef _INCLUDE_GUARD_WINDOWSAPIINPUTLIB_H_

#ifndef _INCLUDE_GUARD_MYUTILITYLIB_H_
#include <MyUtilityLib.h>
#endif	// #ifndef _INCLUDE_GUARD_MYUTILITYLIB_H_

#ifndef _INCLUDE_GUARD_OPENGLGRAPHICLIB_H_
#include <OpenGLGraphicLib.h>
#endif	// #ifndef _INCLUDE_GUARD_OPENGLGRAPHICLIB_H_



//==================================================================================================================================
// usingディレクティブ
//==================================================================================================================================

// ゲーム名前空間
using namespace NS_OpenGLWindowPCGame;



//==================================================================================================================================
// 関数定義
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : コンストラクタ
//
// @note : 
//
//----------------------------------------------------------------------------------------------------------------------------------
GameOver::GameOver()
{ 

}



//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : デストラクタ
//
// @note : 
//
//----------------------------------------------------------------------------------------------------------------------------------
GameOver::~GameOver() 
{

}



//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : 初期化処理
//
// @note : 
//
// 初期化に関する処理はここで行う。
// シーン開始後のシーン切り替え時に1回行なわれる。
//----------------------------------------------------------------------------------------------------------------------------------
void GameOver::Initialize() 
{ 
	// ポインタチェック
	ASSERT_POINTER_CHECK( m_pCamera );


}



//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : 更新処理
//
// @note : 
//
// 更新に関する処理はここで行う。
// シーンが継続している間、描画処理の前に繰り返し行なわれる。
//----------------------------------------------------------------------------------------------------------------------------------
void GameOver::Update() 
{ 
	static float fTimer = 0;
	fTimer += 1;

	if ( 70 <= fTimer ) 
	{
		m_bSceneEndFlg = true;

		fTimer = 0;
	}
}



//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : 描画処理
//
// @note : 
//
// 描画に関する処理はここで行う。
// シーンが継続している間、更新処理の後に繰り返し行なわれる。
//----------------------------------------------------------------------------------------------------------------------------------
void GameOver::Draw() 
{ 
	// ポインタチェック
	ASSERT_POINTER_CHECK( m_pCamera );
/*



	
	Matrix4x4F	mat4World;

	

	mat4World = Matrix4x4F();
	mat4World = 
		NS_Graphic::NS_GraphicMathematics::RotateYAxisMatrixRH( 3.1415f ) *
		NS_Graphic::NS_GraphicMathematics::ScaleMatrix( 2.0f, 2.0f, 0 );

	NS_Graphic::NS_Graphic3D::DrawSprite3D(
		"text_finish",
		Vector2DF( 360, 90 ),
		{ 0, 0, 1, 1 },
		Vector4DF( 1, 1, 1, 1.0f ),
		Vector4DF( 0, 0, 0, -1 ),
		mat4World,
		m_pCamera->GetViewMatrix(),
		m_pCamera->GetProjectionMatrix()
	);
*/
}



//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : 終了処理
//
// @note : 
//
// 終了に関する処理はここで行う。
// シーン終了後のシーン切り替え時に1回行なわれる。
//----------------------------------------------------------------------------------------------------------------------------------
void GameOver::Finish() 
{ 

}



//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : 次に遷移するシーンの生成
//
// @note : 
//
// 次に遷移するシーンを生成する。
// シーン切り替え時等の必要なタイミングで呼び出すように注意する。
//----------------------------------------------------------------------------------------------------------------------------------
void GameOver::CreateNextScene() 
{
	if ( !POINTER_CHECK( m_pNextScene ) ) 
	{
		m_pNextScene = new TitleScene;
	}
}



//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : コンテンツロード
//
// @note : 
//
// コンテンツの読み込み処理はここで行う。
// シーン開始後のシーン切り替え時に1回行なわれる。
//----------------------------------------------------------------------------------------------------------------------------------
void GameOver::LoadContent() 
{ 
//	NS_Graphic::LoadTexture( "Resource/Graphic/Texture/text_finish.tga", "text_finish" );
}



//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : コンテンツアンロード
//
// @note : 
//
// コンテンツの解放処理はここで行う。
// シーン終了後のシーン切り替え時に1回行なわれる。
//----------------------------------------------------------------------------------------------------------------------------------
void GameOver::UnloadContent() 
{
//	NS_Graphic::ClearTexture();
}