#ifndef _INCLUDE_GUARD_UNCOPYABLE_H_
#define _INCLUDE_GUARD_UNCOPYABLE_H_



//==================================================================================================================================
// クラス定義
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : コピー不能クラス
//
// @note : 
//
// このクラスの継承先のクラスをコピー不可能にする。
// private継承で継承する。
//----------------------------------------------------------------------------------------------------------------------------------
class Uncopyable
{
protected:

	// コンストラクタ
	Uncopyable() { }
	
	// デストラクタ
	~Uncopyable() { }

private:

	// コピーコンストラクタ
	Uncopyable( const Uncopyable& );

	// コピー代入演算子
	Uncopyable& operator=( const Uncopyable& );
};



#endif	// #ifndef _INCLUDE_GUARD_UNCOPYABLE_H_