#ifndef _INCLUDE_GUARD_MAINSCENE_H_
#define _INCLUDE_GUARD_MAINSCENE_H_



//==================================================================================================================================
// インクルード
//==================================================================================================================================

#ifndef _INCLUDE_GUARD_BASESCENE_H_
#include "../Base/BaseScene.h"
#endif	// #ifndef _INCLUDE_GUARD_BASESCENE_H_



//==================================================================================================================================
// 前方宣言
//==================================================================================================================================

// 追跡カメラクラス
namespace NS_OpenGLWindowPCGame { class ChaseCamera; }

// ステージクラス
namespace NS_OpenGLWindowPCGame { class Stage; }

// ゲームテキストクラス
namespace NS_OpenGLWindowPCGame { class GameText; }



//==================================================================================================================================
// 名前空間
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : ゲーム名前空間
//
// @note : 
//
// ゲームアプリケーション関連の関数やクラスを管理する名前空間。
// ゲームを構成するクラスは全てこの名前空間に置くようにする。
//----------------------------------------------------------------------------------------------------------------------------------
namespace NS_OpenGLWindowPCGame
{



//==================================================================================================================================
// クラス定義
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : メインシーンクラス
//
// @extends / BaseScene	: 基底シーンクラス
//
// @note : 
//
// メインシーンを管理するクラス。
//----------------------------------------------------------------------------------------------------------------------------------
class MainScene : public BaseScene
{
public:

	// コンストラクタ
	MainScene();

	// デストラクタ
	~MainScene();



	// 初期化処理
	void Initialize();

	// 更新処理
	void Update();

	// 描画処理
	void Draw();

	// 終了処理
	void Finish();

	// コンテンツロード
	void LoadContent();

	// コンテンツアンロード
	void UnloadContent();

private:

	// 次に遷移するシーンの生成
	void CreateNextScene();

private:

	// メンバ変数
	
	// 追跡カメラクラス
	ChaseCamera*		m_pChaseCamera;

	// ステージ
	Stage*				m_pStage;

	// ゲームテキストクラス
	GameText*			m_pGameText;

	// プレイヤーのモデルリソースID
	unsigned int		m_uiPlayerModelResourceID;

	// 弾のモデルリソースID
	unsigned int		m_uiBulletModelResourceID;

	// BGMのサウンド名
	const char*			m_strBGMName;

	// 発射のSE名
	const char*			m_strSEShotName;

	// 弾の衝突のSE名
	const char*			m_strSEHitName;
};



}	// namespace NS_OpenGLWindowPCGame



#endif	// #ifndef _INCLUDE_GUARD_MAINSCENE_H_