#ifndef _INCLUDE_GUARD_INPUTLIBRARY_H_
#define _INCLUDE_GUARD_INPUTLIBRARY_H_



//==================================================================================================================================
// インクルード
//==================================================================================================================================
#ifndef _INCLUDE_GUARD_WAPIINPUTKEYBOARD_H_
#include "Keyboard/WAPIInputKeyboard.h"
#endif	// #ifndef _INCLUDE_GUARD_WAPIINPUTKEYBOARD_H_



//==================================================================================================================================
// ライブラリリンク
//==================================================================================================================================
#pragma comment ( lib, "WindowsAPIInputLibrary.lib" )



#endif	// #ifndef _INCLUDE_GUARD_INPUTLIBRARY_H_