#ifndef _INCLUDE_GUARD_RESOURCEDATA_H_
#define _INCLUDE_GUARD_RESOURCEDATA_H_



//==================================================================================================================================
// インクルード
//==================================================================================================================================

#ifndef _INCLUDE_GUARD_RESOURCEINFO_H_
#include "ResourceInfo.h"
#endif	// #ifndef _INCLUDE_GUARD_RESOURCEINFO_H_

#ifndef _INCLUDE_GUARD_MYUTILITYLIB_H_
#include <MyUtilityLib.h>
#endif	// #ifndef _INCLUDE_GUARD_MYUTILITYLIB_H_



//==================================================================================================================================
// 名前空間
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : リソース名前空間
//
// @note : 
//
// リソース関連の関数やクラス等を管理する名前空間。
//----------------------------------------------------------------------------------------------------------------------------------
namespace NS_Resource
{

	

//==================================================================================================================================
// 構造体定義
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : リソースデータ構造体
//
// @note : 
//
// リソースのデータをまとめた構造体。
//----------------------------------------------------------------------------------------------------------------------------------
struct RESOURCE_DATA 
{
	// リソース情報
	RESOURCE_INFO		resourceInfo;

	// リソース
	void*				resource;



	// コンストラクタ
	RESOURCE_DATA() :
		RESOURCE_DATA( RESOURCE_INFO(), nullptr )
	{ }

	// コンストラクタ
	RESOURCE_DATA( const RESOURCE_INFO& resourceInfo_, void* pResource ) :
		resourceInfo( resourceInfo_ ),
		resource( pResource )
	{ }

	// デストラクタ
	~RESOURCE_DATA() 
	{
		SAFE_DELETE( resource );
	}
};



}	// namespace NS_Resource



#endif	// #ifndef _INCLUDE_GUARD_RESOURCEDATA_H_
