#ifndef _INCLUDE_GUARD_RECT_H_
#define _INCLUDE_GUARD_RECT_H_



//==================================================================================================================================
// 構造体定義
//==================================================================================================================================

//----------------------------------------------------------------------------------------------------------------------------------
// @purpose : 矩形構造体
//
// @note : 
//
// 4つの浮動小数値で矩形を表現する構造体。
//----------------------------------------------------------------------------------------------------------------------------------
struct Rect
{
public:

	Rect() : 
		left( 0 ),
		top( 0 ),
		right( 0 ),
		bottom( 0 )
	{ }

	Rect( const float fLeft, const float fTop, const float fRight, const float fBottom ) : 
		left( fLeft ),
		top( fTop ),
		right( fRight ),
		bottom( fBottom )
	{ }

public:

	float left;		// 左上隅のx座標
	float top;		// 左上隅のy座標
	float right;	// 右下隅のx座標
	float bottom;	// 右下隅のy座標
};



#endif	// #ifndef _INCLUDE_GUARD_RECT_H_